edurange_refactored/graphing/edu-issues.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-29 Fri 14:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Edurange Logging Issues</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Aubrey Birdwell" />
</head>
<body>
<div id="content">
<h1 class="title">Edurange Logging Issues</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcf2ecde">Easy</a>
<ul>
<li><a href="#org8a124b1">Create the milestone.txt / regex for rest of scenarios</a></li>
<li><a href="#org1dd7422">Create Scenario Template CSV data</a></li>
</ul>
</li>
<li><a href="#orgc4fb2c7">Medium</a>
<ul>
<li><a href="#org3cfccdc">Find the code in logging scripts which marks attempt tags</a></li>
<li><a href="#org489568b">Find the code that changes the name of students in the database</a></li>
<li><a href="#orgbce2623">Clean up the flask route for instructor views of graphs</a></li>
</ul>
</li>
<li><a href="#orgff71724">Difficult</a>
<ul>
<li><a href="#orgbbbfc7d">Create a message service</a></li>
<li><a href="#orga814b7b">Create a yaml architecure to describe scenarios</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-orgcf2ecde" class="outline-2">
<h2 id="orgcf2ecde">Easy</h2>
<div class="outline-text-2" id="text-orgcf2ecde">
<hr />
</div>

<div id="outline-container-org8a124b1" class="outline-3">
<h3 id="org8a124b1">Create the milestone.txt / regex for rest of scenarios</h3>
<div class="outline-text-3" id="text-org8a124b1">
<p>
Each scenario has a file called milestones.txt with a regex for
each scenario on a different line in the order the learning
objective appears in the scenario.
</p>

<p>
The scenarios are in:
</p>

<p>
edurange-flask/scenarios/prod/&lt;mile<sub>stone</sub>&gt;/milestones.txt
</p>

<p>
Take a look at filewrangler, getting started, and ssh inception for
examples.
</p>
</div>
</div>

<div id="outline-container-org1dd7422" class="outline-3">
<h3 id="org1dd7422">Create Scenario Template CSV data</h3>
<div class="outline-text-3" id="text-org1dd7422">
<p>
The graphing tool uses csv files which contain descriptions of the
learning objectives / milestones, and dummy nodes for
reports. Those files are in:
</p>

<p>
<i>edurange-flask/edurange<sub>refactored</sub>/graphing/cli<sub>tool</sub>/csv<sub>templates</sub></i>
</p>

<p>
We currently have ones for file wrangler, getting started, and ssh
inception. The rest of the scenarios need these. To create them,
you need to look at the regex in the milestones.txt for the
scenario and organize it like the existing files in the
aforementioned directory. If there is no milestones.txt, then start
by creating that.
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgc4fb2c7" class="outline-2">
<h2 id="orgc4fb2c7">Medium</h2>
<div class="outline-text-2" id="text-orgc4fb2c7">
<hr />
</div>

<div id="outline-container-org3cfccdc" class="outline-3">
<h3 id="org3cfccdc">Find the code in logging scripts which marks attempt tags</h3>
<div class="outline-text-3" id="text-org3cfccdc">
<p>
The perl logging script processes the tty standard input and
output, scraping it and dumping it somewhere.
</p>

<p>
Most of these are in:
</p>

<p>
/edurange-flask/scenarios/global<sub>scripts</sub>
</p>

<p>
There are several python scripts such as analyze.py &#x2026; which
process the data further. The end result is a csv file in
</p>

<p>
<i>edurange-flask/logs</i>
</p>

<p>
This csv has all data associated with a deployed instance of a
scenario. The data also gets put into the database. There is a
milestone tag field in the csv that indicated when a milestone was
complete, M1, M2, &#x2026; or unidentified, U, and is supposed to tag
when there is a partial match to the regex. Say the options are
wrong but command is correct. This should be tagged A1, A2,&#x2026; and
it is not happening. Figure out why!
</p>

<hr />
</div>
</div>

<div id="outline-container-org489568b" class="outline-3">
<h3 id="org489568b">Find the code that changes the name of students in the database</h3>
<div class="outline-text-3" id="text-org489568b">
<p>
When a student is created the naming conventions permit you to put
wierd symbols. Later when the container is created, some of these
characters get stripped out. In the end the database somehow ends
up mismatching the names of the students and the graph logging tool
doesn't display any of their graph information. This is because the
database query for the student / scenario mismatches its
representation in the database. There are several ways to fix this,
make it impossible for instructors to add non-alphanumeric
characters as names, or figure out where this gets stripped out and
fix it there.
</p>

<hr />
</div>
</div>

<div id="outline-container-orgbce2623" class="outline-3">
<h3 id="orgbce2623">Clean up the flask route for instructor views of graphs</h3>
<div class="outline-text-3" id="text-orgbce2623">
<p>
We need to advance the useability of the instructor view of the
student graphs. Currently, the flask route has two drop down menues
that let you select a student and a group. It then renders the
graph. This is accessible at
</p>

<p>
<a href="http://localhost:5000/dashboard/progress_dev">http://localhost:5000/dashboard/progress_dev</a>
</p>

<p>
when the app is running. Note that you must be logged in as admin
to view it.
</p>

<p>
It would be nice to add some additional functionality to this
view. One thing I envision is a vertical side bar to the left of
the graph pane. The side bar should display all students
available. We should be able to query the students periodically to
determine the last activity they did, whether that was an attempt
or a completion of a learning objective, and display that
information compactly next to their name in the sidebar. This way,
it will be even easier for instructors to see when someone is
struggling.
</p>

<hr />
</div>
</div>
</div>

<div id="outline-container-orgff71724" class="outline-2">
<h2 id="orgff71724">Difficult</h2>
<div class="outline-text-2" id="text-orgff71724">
<hr />
</div>

<div id="outline-container-orgbbbfc7d" class="outline-3">
<h3 id="orgbbbfc7d">Create a message service</h3>
<div class="outline-text-3" id="text-orgbbbfc7d">
<p>
This is integral to adding automatic hints and suggestions. We need
to build a simple chat service that either runs in flask or over
linux command line. The idea is that a student could ping the
instructor for suggestions or hints about a particular learning
objective.
</p>

<p>
My thought is that there would be a drop down to select the
learning objective, and a small text entry box where the inquiry
can go. This is forwarded to the instructor, and they can
respond. It is important that the milestone is tagged and that
these messages get stored in the database with a unix timestamp,
the milestone, and natural language conversation. The idea is that
eventually, we can use the instructor feed back again when ML
identifies that a student is in a similar state.
</p>

<p>
For now, lets make it a new flask route or two since the instructor
version should be secure from tampering. We can poach the drop
downs from
</p>

<p>
<a href="http://localhost:5000/dashboard/progress_dev">http://localhost:5000/dashboard/progress_dev</a>
</p>

<p>
Use those drop downs to select a student. Then use your creativity
to make the chat or message system.
</p>

<hr />
</div>
</div>

<div id="outline-container-orga814b7b" class="outline-3">
<h3 id="orga814b7b">Create a yaml architecure to describe scenarios</h3>
<div class="outline-text-3" id="text-orga814b7b">
<p>
We need to design a yaml structure to hold the information about a
scenarios structure. This would include information about the names
of learning objectives, milestone tags, relevent command, options,
working directories, and other state changes relevent to
identifying a learning objective completion.
</p>

<p>
The yaml file template should also have accompanying python tools
which can build the milestones.txt, and csv templates used for the
graphing tool. This project is bigger than it seems. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aubrey Birdwell</p>
<p class="date">Created: 2021-10-29 Fri 14:15</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
